1c-configuration-manager/src/InformationRegisters/СравнениеКонфигураций/СравнениеКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СравнениеКонфигураций</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИзменений</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПредыдущейФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтОкончанияФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВероятностьУспеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПеред</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПосле</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МодульБазовойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>МодульИзмененнойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.ТипыПроблем</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбработки</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/InformationRegisters/РасчетИзмененийКонфигураций/РасчетИзмененийКонфигураций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетИзмененийКонфигураций</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипИзменений</name>
    <type>
      <types>EnumRef.ТипыИзменений</types>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтНачалаФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяПредыдущейФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтОкончанияФункции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Длина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВероятностьУспеха</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Проблема</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПеред</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЯкорьПосле</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>МодульИсходнойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>МодульЦелевойКонфигурации</name>
    <type>
      <types>CatalogRef.СвойстваОбъектаКонфигурации</types>
    </type>
  </resources>
  <resources>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.ТипыПроблем</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>UID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииОбработкиДанных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c-configuration-manager/src/InformationRegisters/СравнениеКонфигураций/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура ПоказатьОтличияИзмененнойОтБазовой(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	ДанныеОтличий = ПолучитьОтличияФайловСравнение(ТекущиеДанные.Сценарий,ТекущиеДанные.Ключ);
	
	КлючФормы = Новый UUID();
	мПараметры = новый Структура();
	мПараметры.Вставить("АдресВоВременномХранилище",ПередатьДанныеВоВнешнююФорму(ДанныеОтличий));
	мПараметры.Вставить("diff_api","diff");
	мПараметры.Вставить("diff_inline",Истина);
	мПараметры.Вставить("КлючФормы",КлючФормы);
	мПараметры.Вставить("ЗаголовокФормы","сравнение: "+ТекущиеДанные.Ключ+" - текущие отличия");
	мПараметры.Вставить("Ключ",ТекущиеДанные.Ключ);
	мПараметры.Вставить("Сценарий",ТекущиеДанные.Сценарий);
	
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаСравненияФайловWebInline",мПараметры,ЭтаФорма,КлючФормы);	
	
	Форма.Открыть();
	Оповестить("diff_изменение",мПараметры,ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПоказатьПланируемуюВставку(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные=Неопределено Тогда
		Возврат;
	КонецЕсли;      
	
	ДанныеОтличий = ПолучитьОтличияФайловРасчетИзменений(ТекущиеДанные.Сценарий,ТекущиеДанные.Ключ);
	
	КлючФормы = Новый UUID();	
	мПараметры = новый Структура();
	мПараметры.Вставить("АдресВоВременномХранилище",ПередатьДанныеВоВнешнююФорму(ДанныеОтличий));
	мПараметры.Вставить("diff_api","diff");
	мПараметры.Вставить("diff_inline",Истина);
	мПараметры.Вставить("КлючФормы",КлючФормы);
	мПараметры.Вставить("ЗаголовокФормы","расчет: "+ТекущиеДанные.Ключ+" - текущие отличия");
	мПараметры.Вставить("Ключ",ТекущиеДанные.Ключ);
	мПараметры.Вставить("Сценарий",ТекущиеДанные.Сценарий);
	
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаСравненияФайловWebInline",мПараметры,ЭтаФорма,КлючФормы);	
	
	Форма.Открыть();
	Оповестить("diff_изменение",мПараметры,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Функция ПередатьДанныеВоВнешнююФорму(МассивДанных)
	
	мСтруктура = новый Структура();
	мСтруктура.Вставить("МассивДанных",МассивДанных);

	Возврат ПоместитьВоВременноеХранилище(мСтруктура);
	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьОтличияФайловСравнение(Сценарий,Ключ)
	
	Возврат РегистрыСведений.СравнениеКонфигураций.ПолучитьОтличияФайловСравнение(Сценарий,Ключ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОтличияФайловРасчетИзменений(Сценарий,Ключ)
	
	Возврат РегистрыСведений.РасчетИзмененийКонфигураций.ПолучитьОтличияФайловРасчетИзменений(Сценарий,Ключ);
	
КонецФункции
